## Plan Result (prod_landing - TerraformPlanApply)




<pre><code>Plan: 1 to add, 18 to change, 0 to destroy.</code></pre>

* Create
  * module.data_landing_zone[&#34;00&#34;].azurerm_synapse_workspace_aad_admin.aad
* Update
  * module.logic[&#34;00&#34;].azurerm_storage_account.this
  * module.data_landing_zone[&#34;00&#34;].module.networking.azurerm_subnet.this[&#34;vnet-data-bricks-private&#34;]
  * module.data_landing_zone[&#34;00&#34;].module.networking.azurerm_subnet.this[&#34;vnet-data-bricks-product-private&#34;]
  * module.data_landing_zone[&#34;00&#34;].module.networking.azurerm_subnet.this[&#34;vnet-data-bricks-product-public&#34;]
  * module.data_landing_zone[&#34;00&#34;].module.networking.azurerm_subnet.this[&#34;vnet-data-bricks-public&#34;]
  * module.data_landing_zone[&#34;00&#34;].module.networking.azurerm_subnet.this[&#34;vnet-data-integration-001&#34;]
  * module.data_landing_zone[&#34;00&#34;].module.networking.azurerm_subnet.this[&#34;vnet-data-integration-002&#34;]
  * module.data_landing_zone[&#34;00&#34;].module.networking.azurerm_subnet.this[&#34;vnet-data-product-001&#34;]
  * module.data_landing_zone[&#34;00&#34;].module.networking.azurerm_subnet.this[&#34;vnet-data-product-002&#34;]
  * module.data_landing_zone[&#34;00&#34;].module.networking.azurerm_subnet.this[&#34;vnet-gh-runners&#34;]
  * module.data_landing_zone[&#34;00&#34;].module.networking.azurerm_subnet.this[&#34;vnet-services&#34;]
  * module.data_landing_zone[&#34;00&#34;].module.networking.azurerm_subnet.this[&#34;vnet-services-mysql&#34;]
  * module.data_landing_zone[&#34;00&#34;].module.storage[&#34;curated&#34;].azurerm_storage_account.storage_account
  * module.data_landing_zone[&#34;00&#34;].module.storage[&#34;external&#34;].azurerm_storage_account.storage_account
  * module.data_landing_zone[&#34;00&#34;].module.storage[&#34;landing&#34;].azurerm_storage_account.storage_account
  * module.data_landing_zone[&#34;00&#34;].module.storage[&#34;raw&#34;].azurerm_storage_account.storage_account
  * module.data_landing_zone[&#34;00&#34;].module.storage[&#34;workspace&#34;].azurerm_storage_account.storage_account
  * module.data_landing_zone[&#34;00&#34;].module.shir001.module.shir_vmss.azurerm_windows_virtual_machine_scale_set.windows_scale_set[0]




<details><summary>Change Result (Click me)</summary>

```hcl

  # module.data_landing_zone["00"].azurerm_synapse_workspace_aad_admin.aad will be created
  + resource "azurerm_synapse_workspace_aad_admin" "aad" {
      + id                   = (known after apply)
      + login                = "DTS Platform Operations SC"
      + object_id            = "4d0554dd-fe60-424a-be9c-36636826d927"
      + synapse_workspace_id = "/subscriptions/e9674938-57cb-43ff-a440-1917658e468c/resourceGroups/ingest00-main-prod/providers/Microsoft.Synapse/workspaces/ingest00-product-synapse001-prod"
      + tenant_id            = "531ff96d-0ae9-462a-8d2d-bec7c0b42082"
    }

  # module.logic["00"].azurerm_storage_account.this will be updated in-place
  ~ resource "azurerm_storage_account" "this" {
      ~ cross_tenant_replication_enabled   = true -> false
        id                                 = "/subscriptions/e9674938-57cb-43ff-a440-1917658e468c/resourceGroups/ingest00-logic-prod/providers/Microsoft.Storage/storageAccounts/ingest00logicprod"
        name                               = "ingest00logicprod"
        tags                               = {
            "Data-Ingest-Project" = "DLRM Ingestion Engine"
            "application"         = "dlrm-data-ingest"
            "builtFrom"           = "hmcts/dlrm-data-ingest-infra"
            "businessArea"        = "cross-cutting"
            "criticality"         = "High"
            "environment"         = "production"
            "startupMode"         = "always"
        }
        # (95 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.data_landing_zone["00"].module.networking.azurerm_subnet.this["vnet-data-bricks-private"] will be updated in-place
  ~ resource "azurerm_subnet" "this" {
        id                                            = "/subscriptions/e9674938-57cb-43ff-a440-1917658e468c/resourceGroups/ingest00-network-prod/providers/Microsoft.Network/virtualNetworks/ingest00-vnet-prod/subnets/ingest00-data-bricks-private-prod"
        name                                          = "ingest00-data-bricks-private-prod"
      ~ private_endpoint_network_policies             = "Enabled" -> "Disabled"
        # (7 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.data_landing_zone["00"].module.networking.azurerm_subnet.this["vnet-data-bricks-product-private"] will be updated in-place
  ~ resource "azurerm_subnet" "this" {
        id                                            = "/subscriptions/e9674938-57cb-43ff-a440-1917658e468c/resourceGroups/ingest00-network-prod/providers/Microsoft.Network/virtualNetworks/ingest00-vnet-prod/subnets/ingest00-data-bricks-product-private-prod"
        name                                          = "ingest00-data-bricks-product-private-prod"
      ~ private_endpoint_network_policies             = "Enabled" -> "Disabled"
        # (7 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.data_landing_zone["00"].module.networking.azurerm_subnet.this["vnet-data-bricks-product-public"] will be updated in-place
  ~ resource "azurerm_subnet" "this" {
        id                                            = "/subscriptions/e9674938-57cb-43ff-a440-1917658e468c/resourceGroups/ingest00-network-prod/providers/Microsoft.Network/virtualNetworks/ingest00-vnet-prod/subnets/ingest00-data-bricks-product-public-prod"
        name                                          = "ingest00-data-bricks-product-public-prod"
      ~ private_endpoint_network_policies             = "Enabled" -> "Disabled"
        # (7 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.data_landing_zone["00"].module.networking.azurerm_subnet.this["vnet-data-bricks-public"] will be updated in-place
  ~ resource "azurerm_subnet" "this" {
        id                                            = "/subscriptions/e9674938-57cb-43ff-a440-1917658e468c/resourceGroups/ingest00-network-prod/providers/Microsoft.Network/virtualNetworks/ingest00-vnet-prod/subnets/ingest00-data-bricks-public-prod"
        name                                          = "ingest00-data-bricks-public-prod"
      ~ private_endpoint_network_policies             = "Enabled" -> "Disabled"
        # (7 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.data_landing_zone["00"].module.networking.azurerm_subnet.this["vnet-data-integration-001"] will be updated in-place
  ~ resource "azurerm_subnet" "this" {
        id                                            = "/subscriptions/e9674938-57cb-43ff-a440-1917658e468c/resourceGroups/ingest00-network-prod/providers/Microsoft.Network/virtualNetworks/ingest00-vnet-prod/subnets/ingest00-data-integration-001-prod"
        name                                          = "ingest00-data-integration-001-prod"
      ~ private_endpoint_network_policies             = "Enabled" -> "Disabled"
        # (7 unchanged attributes hidden)
    }

  # module.data_landing_zone["00"].module.networking.azurerm_subnet.this["vnet-data-integration-002"] will be updated in-place
  ~ resource "azurerm_subnet" "this" {
        id                                            = "/subscriptions/e9674938-57cb-43ff-a440-1917658e468c/resourceGroups/ingest00-network-prod/providers/Microsoft.Network/virtualNetworks/ingest00-vnet-prod/subnets/ingest00-data-integration-002-prod"
        name                                          = "ingest00-data-integration-002-prod"
      ~ private_endpoint_network_policies             = "Enabled" -> "Disabled"
        # (7 unchanged attributes hidden)
    }

  # module.data_landing_zone["00"].module.networking.azurerm_subnet.this["vnet-data-product-001"] will be updated in-place
  ~ resource "azurerm_subnet" "this" {
        id                                            = "/subscriptions/e9674938-57cb-43ff-a440-1917658e468c/resourceGroups/ingest00-network-prod/providers/Microsoft.Network/virtualNetworks/ingest00-vnet-prod/subnets/ingest00-data-product-001-prod"
        name                                          = "ingest00-data-product-001-prod"
      ~ private_endpoint_network_policies             = "Enabled" -> "Disabled"
        # (7 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.data_landing_zone["00"].module.networking.azurerm_subnet.this["vnet-data-product-002"] will be updated in-place
  ~ resource "azurerm_subnet" "this" {
        id                                            = "/subscriptions/e9674938-57cb-43ff-a440-1917658e468c/resourceGroups/ingest00-network-prod/providers/Microsoft.Network/virtualNetworks/ingest00-vnet-prod/subnets/ingest00-data-product-002-prod"
        name                                          = "ingest00-data-product-002-prod"
      ~ private_endpoint_network_policies             = "Enabled" -> "Disabled"
        # (7 unchanged attributes hidden)
    }

  # module.data_landing_zone["00"].module.networking.azurerm_subnet.this["vnet-gh-runners"] will be updated in-place
  ~ resource "azurerm_subnet" "this" {
        id                                            = "/subscriptions/e9674938-57cb-43ff-a440-1917658e468c/resourceGroups/ingest00-network-prod/providers/Microsoft.Network/virtualNetworks/ingest00-vnet-prod/subnets/ingest00-gh-runners-prod"
        name                                          = "ingest00-gh-runners-prod"
      ~ private_endpoint_network_policies             = "Enabled" -> "Disabled"
        # (7 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.data_landing_zone["00"].module.networking.azurerm_subnet.this["vnet-services"] will be updated in-place
  ~ resource "azurerm_subnet" "this" {
        id                                            = "/subscriptions/e9674938-57cb-43ff-a440-1917658e468c/resourceGroups/ingest00-network-prod/providers/Microsoft.Network/virtualNetworks/ingest00-vnet-prod/subnets/ingest00-services-prod"
        name                                          = "ingest00-services-prod"
      ~ private_endpoint_network_policies             = "Enabled" -> "Disabled"
        # (7 unchanged attributes hidden)
    }

  # module.data_landing_zone["00"].module.networking.azurerm_subnet.this["vnet-services-mysql"] will be updated in-place
  ~ resource "azurerm_subnet" "this" {
        id                                            = "/subscriptions/e9674938-57cb-43ff-a440-1917658e468c/resourceGroups/ingest00-network-prod/providers/Microsoft.Network/virtualNetworks/ingest00-vnet-prod/subnets/ingest00-services-mysql-prod"
        name                                          = "ingest00-services-mysql-prod"
      ~ private_endpoint_network_policies             = "Enabled" -> "Disabled"
        # (7 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.data_landing_zone["00"].module.storage["curated"].azurerm_storage_account.storage_account will be updated in-place
  ~ resource "azurerm_storage_account" "storage_account" {
      ~ cross_tenant_replication_enabled   = true -> false
        id                                 = "/subscriptions/e9674938-57cb-43ff-a440-1917658e468c/resourceGroups/ingest00-main-prod/providers/Microsoft.Storage/storageAccounts/ingest00curatedprod"
        name                               = "ingest00curatedprod"
        tags                               = {
            "Data-Ingest-Project" = "DLRM Ingestion Engine"
            "application"         = "dlrm-data-ingest"
            "autoShutdown"        = "false"
            "builtFrom"           = "hmcts/dlrm-data-ingest-infra"
            "businessArea"        = "cross-cutting"
            "criticality"         = "High"
            "environment"         = "production"
            "startupMode"         = "always"
        }
        # (95 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.data_landing_zone["00"].module.storage["external"].azurerm_storage_account.storage_account will be updated in-place
  ~ resource "azurerm_storage_account" "storage_account" {
      ~ cross_tenant_replication_enabled   = true -> false
        id                                 = "/subscriptions/e9674938-57cb-43ff-a440-1917658e468c/resourceGroups/ingest00-main-prod/providers/Microsoft.Storage/storageAccounts/ingest00externalprod"
        name                               = "ingest00externalprod"
        tags                               = {
            "Data-Ingest-Project" = "DLRM Ingestion Engine"
            "application"         = "dlrm-data-ingest"
            "autoShutdown"        = "false"
            "builtFrom"           = "hmcts/dlrm-data-ingest-infra"
            "businessArea"        = "cross-cutting"
            "criticality"         = "High"
            "environment"         = "production"
            "startupMode"         = "always"
        }
        # (95 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.data_landing_zone["00"].module.storage["landing"].azurerm_storage_account.storage_account will be updated in-place
  ~ resource "azurerm_storage_account" "storage_account" {
      ~ cross_tenant_replication_enabled   = true -> false
        id                                 = "/subscriptions/e9674938-57cb-43ff-a440-1917658e468c/resourceGroups/ingest00-main-prod/providers/Microsoft.Storage/storageAccounts/ingest00landingprod"
        name                               = "ingest00landingprod"
        tags                               = {
            "Data-Ingest-Project" = "DLRM Ingestion Engine"
            "application"         = "dlrm-data-ingest"
            "autoShutdown"        = "false"
            "builtFrom"           = "hmcts/dlrm-data-ingest-infra"
            "businessArea"        = "cross-cutting"
            "criticality"         = "High"
            "environment"         = "production"
            "startupMode"         = "always"
        }
        # (95 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.data_landing_zone["00"].module.storage["raw"].azurerm_storage_account.storage_account will be updated in-place
  ~ resource "azurerm_storage_account" "storage_account" {
      ~ cross_tenant_replication_enabled   = true -> false
        id                                 = "/subscriptions/e9674938-57cb-43ff-a440-1917658e468c/resourceGroups/ingest00-main-prod/providers/Microsoft.Storage/storageAccounts/ingest00rawprod"
        name                               = "ingest00rawprod"
        tags                               = {
            "Data-Ingest-Project" = "DLRM Ingestion Engine"
            "application"         = "dlrm-data-ingest"
            "autoShutdown"        = "false"
            "builtFrom"           = "hmcts/dlrm-data-ingest-infra"
            "businessArea"        = "cross-cutting"
            "criticality"         = "High"
            "environment"         = "production"
            "startupMode"         = "always"
        }
        # (95 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.data_landing_zone["00"].module.storage["workspace"].azurerm_storage_account.storage_account will be updated in-place
  ~ resource "azurerm_storage_account" "storage_account" {
      ~ cross_tenant_replication_enabled   = true -> false
        id                                 = "/subscriptions/e9674938-57cb-43ff-a440-1917658e468c/resourceGroups/ingest00-main-prod/providers/Microsoft.Storage/storageAccounts/ingest00workspaceprod"
        name                               = "ingest00workspaceprod"
        tags                               = {
            "Data-Ingest-Project" = "DLRM Ingestion Engine"
            "application"         = "dlrm-data-ingest"
            "autoShutdown"        = "false"
            "builtFrom"           = "hmcts/dlrm-data-ingest-infra"
            "businessArea"        = "cross-cutting"
            "criticality"         = "High"
            "environment"         = "production"
            "startupMode"         = "always"
        }
        # (95 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.data_landing_zone["00"].module.shir001.module.shir_vmss.data.azurerm_subscription.current will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_subscription" "current" {
      + display_name          = (known after apply)
      + id                    = (known after apply)
      + location_placement_id = (known after apply)
      + quota_id              = (known after apply)
      + spending_limit        = (known after apply)
      + state                 = (known after apply)
      + subscription_id       = (known after apply)
      + tags                  = (known after apply)
      + tenant_id             = (known after apply)
    }

  # module.data_landing_zone["00"].module.shir001.module.shir_vmss.azurerm_windows_virtual_machine_scale_set.windows_scale_set[0] will be updated in-place
  ~ resource "azurerm_windows_virtual_machine_scale_set" "windows_scale_set" {
        id                                                = "/subscriptions/e9674938-57cb-43ff-a440-1917658e468c/resourceGroups/ingest00-main-prod/providers/Microsoft.Compute/virtualMachineScaleSets/ingest00-shir001-vmss-prod"
        name                                              = "ingest00-shir001-vmss-prod"
        tags                                              = {
            "Data-Ingest-Project" = "DLRM Ingestion Engine"
            "application"         = "dlrm-data-ingest"
            "autoShutdown"        = "false"
            "builtFrom"           = "hmcts/dlrm-data-ingest-infra"
            "businessArea"        = "cross-cutting"
            "criticality"         = "High"
            "environment"         = "production"
            "startupMode"         = "always"
        }
        # (33 unchanged attributes hidden)

      - scale_in {
          - force_deletion_enabled = false -> null
          - rule                   = "Default" -> null
        }

        # (5 unchanged blocks hidden)
    }

Plan: 1 to add, 18 to change, 0 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":50,"Program":"tfcmt","SHA1":"","Target":"prod_landing - TerraformPlanApply","Vars":{}} -->